---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationRodsDisconnectedError
source: html/25dd27fd-ce98-7d0c-9bd9-bd336cab77dc.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationRodsDisconnectedError Property

The hanger rod was disconnected because there is no structural component above.

## Syntax (C#)
```csharp
public static FailureDefinitionId FabricationRodsDisconnectedError { get; }
```